Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
resnet50 (Functional)        (None, 7, 7, 2048)        23587712  
_________________________________________________________________
global_average_pooling2d (Gl (None, 2048)              0         
_________________________________________________________________
dense (Dense)                (None, 2048)              4194304   
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              2097152   
_________________________________________________________________
dense_2 (Dense)              (None, 512)               524288    
_________________________________________________________________
dropout (Dropout)            (None, 512)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 120)               61560     
=================================================================
Total params: 30,465,016
Trainable params: 6,877,304
Non-trainable params: 23,587,712
_________________________________________________________________
