Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_94 (Conv2D)           (None, 224, 224, 16)      432       
_________________________________________________________________
batch_normalization_94 (Batc (None, 224, 224, 16)      48        
_________________________________________________________________
activation_94 (Activation)   (None, 224, 224, 16)      0         
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 56, 56, 16)        0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 56, 56, 16)        0         
_________________________________________________________________
conv2d_95 (Conv2D)           (None, 56, 56, 32)        4608      
_________________________________________________________________
batch_normalization_95 (Batc (None, 56, 56, 32)        96        
_________________________________________________________________
activation_95 (Activation)   (None, 56, 56, 32)        0         
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 14, 14, 32)        0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 14, 14, 32)        0         
_________________________________________________________________
conv2d_96 (Conv2D)           (None, 14, 14, 64)        18432     
_________________________________________________________________
batch_normalization_96 (Batc (None, 14, 14, 64)        192       
_________________________________________________________________
activation_96 (Activation)   (None, 14, 14, 64)        0         
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 4, 4, 64)          0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 4, 4, 64)          0         
_________________________________________________________________
conv2d_97 (Conv2D)           (None, 4, 4, 128)         73728     
_________________________________________________________________
batch_normalization_97 (Batc (None, 4, 4, 128)         384       
_________________________________________________________________
activation_97 (Activation)   (None, 4, 4, 128)         0         
_________________________________________________________________
flatten (Flatten)            (None, 2048)              0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 2048)              0         
_________________________________________________________________
dense_12 (Dense)             (None, 512)               1049088   
_________________________________________________________________
dense_13 (Dense)             (None, 120)               61560     
=================================================================
Total params: 1,208,568
Trainable params: 1,208,088
Non-trainable params: 480
_________________________________________________________________
