Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
inception_v3 (Functional)    (None, 5, 5, 2048)        21802784  
_________________________________________________________________
global_average_pooling2d_1 ( (None, 2048)              0         
_________________________________________________________________
dense_4 (Dense)              (None, 2048)              4194304   
_________________________________________________________________
dense_5 (Dense)              (None, 1024)              2097152   
_________________________________________________________________
dense_6 (Dense)              (None, 512)               524288    
_________________________________________________________________
dropout_1 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_7 (Dense)              (None, 120)               61560     
=================================================================
Total params: 28,680,088
Trainable params: 6,877,304
Non-trainable params: 21,802,784
_________________________________________________________________
