Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
vgg16 (Functional)           (None, 7, 7, 512)         14714688  
_________________________________________________________________
global_average_pooling2d_1 ( (None, 512)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 2048)              1048576   
_________________________________________________________________
dense_5 (Dense)              (None, 1024)              2097152   
_________________________________________________________________
dense_6 (Dense)              (None, 512)               524288    
_________________________________________________________________
dropout_1 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_7 (Dense)              (None, 120)               61560     
=================================================================
Total params: 18,446,264
Trainable params: 3,731,576
Non-trainable params: 14,714,688
_________________________________________________________________
